asciiart-load-test.yml
config:
  target: http://localhost:3000 
  phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 5
      name: Warm up phase
    - duration: 60
      arrivalRate: 5
      rampTo: 10
      name: Ramp up load
    - duration: 30
      arrivalRate: 10
      rampTo: 30
      name: Spike phase
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
    thresholds:
      - http.response_time.p99: 100
      - http.response_time.p95: 75
scenarios:
  - flow:
      - post:
          url: '/api/userCart'
          headers:
            Cookie: 'eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJlbWFpbCI6ImFzZ2hhckBnbWFpbC5jb20iLCJpYXQiOjE3Mjc0MTQzOTgsImV4cCI6MTcyNzQxNjE5OH0.OD9d1jLoBBZDAI_vfjpaTxzZLtcmgzvVRUNlzdXWwVg'  # Replace with the actual token
          json:
            email: 'asghar@gmail.com'
            imgUrl: '/path/to/image'
            title: 'Sample Product'
            price: 19.99
            qty: 2
      - post:
          url: '/api/userCart'
          headers:
            Cookie: 'eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJlbWFpbCI6ImFzZ2hhckBnbWFpbC5jb20iLCJpYXQiOjE3Mjc0MTQzOTgsImV4cCI6MTcyNzQxNjE5OH0.OD9d1jLoBBZDAI_vfjpaTxzZLtcmgzvVRUNlzdXWwVg'  # Replace with the actual token
          json:
            email: 'ali@gmail.com'
            imgUrl: '/path/to/image'
            title: 'Sample Product'
            price: 19.99
            qty: 2
      - post:
          url: '/api/userCart?action=delAll'
          headers:
            Cookie: 'eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJlbWFpbCI6ImFzZ2hhckBnbWFpbC5jb20iLCJpYXQiOjE3Mjc0MTQzOTgsImV4cCI6MTcyNzQxNjE5OH0.OD9d1jLoBBZDAI_vfjpaTxzZLtcmgzvVRUNlzdXWwVg'  # Replace with the actual token
          json:
            action: 'delAll'
            email: 'asghar@gmail.com'
      - post:
          url: '/api/userCart?action=delAll'
          headers:
            Cookie: 'eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJlbWFpbCI6ImFzZ2hhckBnbWFpbC5jb20iLCJpYXQiOjE3Mjc0MTQzOTgsImV4cCI6MTcyNzQxNjE5OH0.OD9d1jLoBBZDAI_vfjpaTxzZLtcmgzvVRUNlzdXWwVg'  # Replace with the actual token
          json:
            action: 'delAll'
            email: 'ali@gmail.com'